; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


(define (domain thoughtful-typed)
	(:requirements :typing)
	(:types card colnum num suittype)
	(:predicates (on ?c1 - card ?c2 - card)
		(ace ?c - card)
		(king ?c - card)
		(clear ?c - card)
		(colspace ?n - colnum)
  		(bottomtalon ?c - card)
		(toptalon ?c - card)
		(ontalon ?c1 - card ?c2 - card)
		(talonplayable ?c - card)
		(instack ?c - card)
		(home ?c - card)
		(faceup ?c - card)
		(bottomcol ?c - card)
		(suit ?c - card ?s - suittype)
		(value ?c - card ?v - num)
		(successor ?n1 - num ?n0 - num)
		(canstack ?c1 - card ?c2 - card)
		(colsuccessor ?n1 - colnum ?n0 - colnum)
)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card between columns.  
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from one column to another

	(:action move-col-to-col
		:parameters (?card ?oldcard ?newcard - card)
		:precondition (and 
			(faceup ?card)
			(clear ?newcard)
			(canstack ?card ?newcard)
			(on ?card ?oldcard))
		:effect(and
			(on ?card ?newcard)
			(clear ?oldcard)
			(faceup ?oldcard)
			(not (on ?card ?oldcard))
			(not (clear ?newcard))))

;; move card from one column to another - create an empty column

	(:action move-col-to-col-b
		:parameters (?card ?newcard - card ?cols ?ncols - colnum)
		:precondition (and 
				(faceup ?card)
				(bottomcol ?card)
				(clear ?newcard)
				(canstack ?card ?newcard)
				(colspace ?cols)
				(colsuccessor ?ncols ?cols))
		:effect (and 
			(on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; send a king to an empty column

	(:action move-col-to-col-c
		:parameters (?card ?oldcard - card ?cols ?ncols - colnum)
		:precondition (and
			(faceup ?card)
			(king ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
		:effect (and
			(bottomcol ?card)
			(clear ?oldcard)
			(faceup ?oldcard)
			(colspace ?ncols)
			(not (on ?card ?oldcard))
			(not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from column to home 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action col-to-home
		:parameters (?card ?oldcard - card ?suit - suittype ?vcard - num
				?homecard - card ?vhomecard - num)
		:precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(suit ?card ?suit)
			(suit ?homecard ?suit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(home ?card)
			(clear ?oldcard)
			(faceup ?oldcard)
			(on ?card ?homecard)
			(not (on ?card ?oldcard))
			(not (home ?homecard))
			(not (faceup ?card))
			(not (clear ?card))))

;; Move card from column to home - create an empty column

	(:action col-to-home-b
		:parameters (?card ?homecard - card ?suit - suittype ?vcard - num 
			?vhomecard - num ?cols ?ncols - colnum)
		:precondition (and
			(clear ?card)
			(bottomcol ?card)
			(home ?homecard)
			(suit ?card ?suit)
			(suit ?homecard ?suit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(colspace ?cols)
			(colsuccessor ?ncols ?cols))
		:effect (and
			(home ?card)
			(colspace ?ncols)
			(not (home ?homecard))
			(not (faceup ?card))
			(not (clear ?card))
			(not (bottomcol ?card))
			(not (colspace ?cols))))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from talon to column 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

	(:action tal-to-col
		:parameters (?card ?oldcard ?newcard ?cardabove - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?card ?oldcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(canstack ?card ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(talonplayable ?oldcard)
			(on ?card ?newcard)
			(ontalon ?cardabove ?oldcard)
			(not (clear ?newcard))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))
			(not (ontalon ?cardabove ?card))))

;; move card from talon to column - card is bottom card in talon

	(:action tal-to-col-b
		:parameters (?card ?newcard ?cardabove - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(bottomtalon ?card)
			(canstack ?card ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (clear ?newcard))
			(not (ontalon ?cardabove ?card))))

;; move card from talon to column - card is top card in talon

	(:action tal-to-col-c
		:parameters (?card ?newcard ?oldcard - card)
		:precondition (and
			(clear ?newcard)
			(ontalon ?card ?oldcard)
			(canstack ?card ?newcard)
			(talonplayable ?card)
			(toptalon ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(toptalon ?oldcard)
			(talonplayable ?oldcard)
			(not (clear ?newcard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))))

;; move card from talon to column - card is the only card in talon

	(:action tal-to-col-d
		:parameters (?card ?newcard - card)
		:precondition (and
			(clear ?newcard)
			(canstack ?card ?newcard)
			(bottomtalon ?card)
			(toptalon ?card)
			(talonplayable ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(on ?card ?newcard)
			(not (clear ?newcard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))

;; move king from talon to column

	(:action tal-to-col-e
		:parameters (?card ?oldcard ?cardabove - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?card ?oldcard)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(talonplayable ?oldcard)
			(ontalon ?cardabove ?oldcard)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))
			(not (ontalon ?cardabove ?card))))

;; move king from talon to column - king is bottom card in talon

	(:action tal-to-col-f
		:parameters (?card ?cardabove - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?cardabove ?card)
			(talonplayable ?card)
			(bottomtalon ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?cardabove ?card))))

;; move king from talon to column - card is top card in talon

	(:action tal-to-col-g
		:parameters (?card ?oldcard - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(ontalon ?card ?oldcard)
			(talonplayable ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(toptalon ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(toptalon ?oldcard)
			(talonplayable ?oldcard)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?oldcard))))

;; move king from talon to column - card is the only card in talon

	(:action tal-to-col-h
		:parameters (?card - card ?cols ?ncols - colnum)
		:precondition (and
			(king ?card)
			(bottomtalon ?card)
			(toptalon ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(talonplayable ?card))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(bottomcol ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from talon to home 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from talon to home

	(:action tal-to-home
		:parameters (?card ?cardabove ?cardbelow ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?cardabove ?card)
			(ontalon ?card ?cardbelow)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(home ?homecard)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(talonplayable ?cardbelow)
			(not (talonplayable ?card))
			(ontalon ?cardabove ?cardbelow)
			(not (ontalon ?cardabove ?card))
			(not (ontalon ?card ?cardbelow))
			(home ?card)
			(not (home ?homecard))))

;; move card from talon to home - card is bottom card in talon

	(:action tal-to-home-b
		:parameters (?card ?cardabove ?homecard  - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?cardabove ?card)
			(bottomtalon ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(bottomtalon ?cardabove)
			(talonplayable ?cardabove)
			(home ?card)
			(not (bottomtalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?cardabove ?card))
			(not (home ?homecard))))

;; move card from talon to home - card is top card in talon

	(:action tal-to-home-c
		:parameters (?card ?cardbelow ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(ontalon ?card ?cardbelow)
			(talonplayable ?card)
			(toptalon ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(toptalon ?cardbelow)
			(talonplayable ?cardbelow)
			(home ?card)
			(not (home ?homecard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (ontalon ?card ?cardbelow))))

;; move card from talon to home - card is the only card in talon

	(:action tal-to-home-d
		:parameters (?card ?homecard - card ?cardsuit - suittype
			?vcard ?vhomecard - num)
		:precondition (and
			(bottomtalon ?card)
			(toptalon ?card)
			(talonplayable ?card)
			(home ?homecard)
			(suit ?card ?cardsuit)
			(suit ?homecard ?cardsuit)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
		:effect (and
			(home ?card)
			(not (home ?homecard))
			(not (toptalon ?card))
			(not (talonplayable ?card))
			(not (bottomtalon ?card))))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Move card from home to column (pointless to move aces from home)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; move card from home to column
	
	(:action home-to-col
		:parameters (?card ?cardbelow ?newcard - card ?cardsuit - suittype
			?vcard ?vcardbelow - num)
		:precondition (and
			(home ?card)
			(suit ?card ?cardsuit)
			(suit ?cardbelow ?cardsuit)
			(value ?card ?vcard)
			(value ?cardbelow ?vcardbelow)
			(successor ?vcard ?vcardbelow)
			(canstack ?card ?newcard)
			(clear ?newcard))
		:effect (and
			(clear ?card)
			(faceup ?card)
			(home ?cardbelow)
			(on ?card ?newcard)
			(not (home ?card))
			(not (clear ?newcard))))

;; move king from home to column
	
	(:action home-to-col-a
		:parameters (?card ?cardbelow - card ?cardsuit - suittype
			?vcard ?vcardbelow - num ?cols ?ncols - colnum)
		:precondition (and
			(home ?card)
			(king ?card)
			(suit ?card ?cardsuit)
			(suit ?cardbelow ?cardsuit)
			(value ?card ?vcard)
			(value ?cardbelow ?vcardbelow)
			(successor ?vcard ?vcardbelow)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols))
		:effect (and
			(home ?cardbelow)
			(bottomcol ?card)
			(clear ?card)
			(faceup ?card)
			(colspace ?ncols)
			(not (colspace ?cols))
			(not (home ?card))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;; Turn Deck
;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			
;; turn deck

	(:action turn-deck
		:parameters (?card ?c1 - card)
		:precondition (and
			(talonplayable ?card)
			(ontalon ?c1 ?card))
		:effect (and
			(talonplayable ?c1)
			(not (talonplayable ?card))))

;; turn deck - top talon card is currently talon playable	- at least 4 cards in talon

	(:action turn-deck-a
		:parameters (?card ?c1 - card)
		:precondition (and
			(talonplayable ?card)
			(toptalon ?card)
			(bottomtalon ?c1))
		:effect (and
			(talonplayable ?c1)
			(not (talonplayable ?card)))))
			
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

; problem
(define (problem thoughtful-s5-t4)
(:domain thoughtful-typed)
(:objects
    DUMMY1 DUMMY2 DUMMY3 DUMMY4
    C0 CA C2 C3 C4 C5 
    D0 DA D2 D3 D4 D5 
    H0 HA H2 H3 H4 H5 
    S0 SA S2 S3 S4 S5 
 - card
    COLN0 COLN1 COLN2 COLN3 COLN4
 - colnum
    N0 N1 N2 N3 N4 N5
 - num
    C D H S
 - suittype
)
(:init
(VALUE C0 N0)
(VALUE D0 N0)
(VALUE H0 N0)
(VALUE S0 N0)
(VALUE CA N1)
(VALUE DA N1)
(VALUE HA N1)
(VALUE SA N1)
(VALUE C2 N2)
(VALUE D2 N2)
(VALUE H2 N2)
(VALUE S2 N2)
(VALUE C3 N3)
(VALUE D3 N3)
(VALUE H3 N3)
(VALUE S3 N3)
(VALUE C4 N4)
(VALUE D4 N4)
(VALUE H4 N4)
(VALUE S4 N4)
(VALUE C5 N5)
(VALUE D5 N5)
(VALUE H5 N5)
(VALUE S5 N5)
(COLSUCCESSOR COLN1 COLN0)
(COLSUCCESSOR COLN2 COLN1)
(COLSUCCESSOR COLN3 COLN2)
(COLSUCCESSOR COLN4 COLN3)
(SUCCESSOR N1 N0)
(SUCCESSOR N2 N1)
(SUCCESSOR N3 N2)
(SUCCESSOR N4 N3)
(SUCCESSOR N5 N4)
(SUIT C0 C)
(SUIT D0 D)
(SUIT H0 H)
(SUIT S0 S)
(SUIT CA C)
(SUIT DA D)
(SUIT HA H)
(SUIT SA S)
(SUIT C2 C)
(SUIT D2 D)
(SUIT H2 H)
(SUIT S2 S)
(SUIT C3 C)
(SUIT D3 D)
(SUIT H3 H)
(SUIT S3 S)
(SUIT C4 C)
(SUIT D4 D)
(SUIT H4 H)
(SUIT S4 S)
(SUIT C5 C)
(SUIT D5 D)
(SUIT H5 H)
(SUIT S5 S)
(KING C5)
(KING D5)
(KING H5)
(KING S5)
(CANSTACK C2 D3)
(CANSTACK C2 H3)
(CANSTACK S2 D3)
(CANSTACK S2 H3)
(CANSTACK D2 C3)
(CANSTACK D2 S3)
(CANSTACK H2 C3)
(CANSTACK H2 S3)
(CANSTACK C3 D4)
(CANSTACK C3 H4)
(CANSTACK S3 D4)
(CANSTACK S3 H4)
(CANSTACK D3 C4)
(CANSTACK D3 S4)
(CANSTACK H3 C4)
(CANSTACK H3 S4)
(CANSTACK C4 D5)
(CANSTACK C4 H5)
(CANSTACK S4 D5)
(CANSTACK S4 H5)
(CANSTACK D4 C5)
(CANSTACK D4 S5)
(CANSTACK H4 C5)
(CANSTACK H4 S5)
(COLSPACE COLN0)
(BOTTOMCOL H5)
(CLEAR H5)
(FACEUP H5)
(BOTTOMCOL CA)
(ON H2 CA)
(CLEAR H2)
(FACEUP H2)
(BOTTOMCOL D2)
(ON S5 D2)
(ON C3 S5)
(CLEAR C3)
(FACEUP C3)
(BOTTOMCOL H3)
(ON C2 H3)
(ON S4 C2)
(ON D4 S4)
(CLEAR D4)
(FACEUP D4)
(BOTTOMTALON C5)
(ONTALON D3 C5)
(ONTALON H4 D3)
(ONTALON C4 H4)
(ONTALON S3 C4)
(ONTALON D5 S3)
(ONTALON SA D5)
(ONTALON HA SA)
(ONTALON DA HA)
(ONTALON S2 DA)
(TOPTALON S2)
(TALONPLAYABLE H4)
(HOME C0)
(HOME D0)
(HOME H0)
(HOME S0)
)
(:goal
(and
(HOME C5)
(HOME D5)
(HOME H5)
(HOME S5)
)
)
)

; plan
1. (turn-deck h4 c4)
   deleted: (talonplayable h4)
   added: (talonplayable c4)
   goals met: 0 of 4
2. (turn-deck c4 s3)
   deleted: (talonplayable c4)
   added: (talonplayable s3)
   goals met: 0 of 4
3. (turn-deck s3 d5)
   deleted: (talonplayable s3)
   added: (talonplayable d5)
   goals met: 0 of 4
4. (turn-deck d5 sa)
   deleted: (talonplayable d5)
   added: (talonplayable sa)
   goals met: 0 of 4
5. (turn-deck sa ha)
   deleted: (talonplayable sa)
   added: (talonplayable ha)
   goals met: 0 of 4
6. (tal-to-home ha da sa h0 h n1 n0)
   deleted: (talonplayable ha) (ontalon da ha) (ontalon ha sa) (home h0)
   added: (talonplayable sa) (ontalon da sa) (home ha)
   goals met: 0 of 4
7. (col-to-home h2 ca h n2 ha n1)
   deleted: (on h2 ca) (home ha) (faceup h2) (clear h2)
   added: (home h2) (clear ca) (faceup ca) (on h2 ha)
   goals met: 0 of 4
8. (move-col-to-col c3 s5 d4)
   deleted: (on c3 s5) (clear d4)
   added: (on c3 d4) (clear s5) (faceup s5)
   goals met: 0 of 4
9. (tal-to-home sa da d5 s0 s n1 n0)
   deleted: (talonplayable sa) (ontalon da sa) (ontalon sa d5) (home s0)
   added: (talonplayable d5) (ontalon da d5) (home sa)
   goals met: 0 of 4
10. (col-to-home-b ca c0 c n1 n0 coln0 coln1)
   deleted: (home c0) (faceup ca) (clear ca) (bottomcol ca) (colspace coln0)
   added: (home ca) (colspace coln1)
   goals met: 0 of 4
11. (move-col-to-col d4 s4 s5)
   deleted: (on d4 s4) (clear s5)
   added: (on d4 s5) (clear s4) (faceup s4)
   goals met: 0 of 4
12. (tal-to-col-e d5 s3 da coln1 coln0)
   deleted: (colspace coln1) (talonplayable d5) (ontalon d5 s3) (ontalon da d5)
   added: (clear d5) (faceup d5) (talonplayable s3) (ontalon da s3) (bottomcol d5) (colspace coln0)
   goals met: 0 of 4
13. (move-col-to-col s4 c2 d5)
   deleted: (on s4 c2) (clear d5)
   added: (on s4 d5) (clear c2) (faceup c2)
   goals met: 0 of 4
14. (col-to-home c2 h3 c n2 ca n1)
   deleted: (on c2 h3) (home ca) (faceup c2) (clear c2)
   added: (home c2) (clear h3) (faceup h3) (on c2 ca)
   goals met: 0 of 4
15. (col-to-home c3 d4 c n3 c2 n2)
   deleted: (on c3 d4) (home c2) (faceup c3) (clear c3)
   added: (home c3) (clear d4) (on c3 c2)
   goals met: 0 of 4
16. (tal-to-col s3 c4 d4 da)
   deleted: (clear d4) (talonplayable s3) (ontalon s3 c4) (ontalon da s3)
   added: (clear s3) (faceup s3) (talonplayable c4) (on s3 d4) (ontalon da c4)
   goals met: 0 of 4
17. (tal-to-home c4 da h4 c3 c n4 n3)
   deleted: (talonplayable c4) (ontalon da c4) (ontalon c4 h4) (home c3)
   added: (talonplayable h4) (ontalon da h4) (home c4)
   goals met: 0 of 4
18. (col-to-home-b h3 h2 h n3 n2 coln0 coln1)
   deleted: (home h2) (faceup h3) (clear h3) (bottomcol h3) (colspace coln0)
   added: (home h3) (colspace coln1)
   goals met: 0 of 4
19. (tal-to-home h4 da d3 h3 h n4 n3)
   deleted: (talonplayable h4) (ontalon da h4) (ontalon h4 d3) (home h3)
   added: (talonplayable d3) (ontalon da d3) (home h4)
   goals met: 0 of 4
20. (col-to-home-b h5 h4 h n5 n4 coln1 coln2)
   deleted: (home h4) (faceup h5) (clear h5) (bottomcol h5) (colspace coln1)
   added: (home h5) (colspace coln2)
   goals met: 1 of 4
21. (tal-to-col d3 c5 s4 da)
   deleted: (clear s4) (talonplayable d3) (ontalon d3 c5) (ontalon da d3)
   added: (clear d3) (faceup d3) (talonplayable c5) (on d3 s4) (ontalon da c5)
   goals met: 1 of 4
22. (tal-to-home-b c5 da c4 c n5 n4)
   deleted: (bottomtalon c5) (talonplayable c5) (ontalon da c5) (home c4)
   added: (bottomtalon da) (talonplayable da) (home c5)
   goals met: 2 of 4
23. (move-col-to-col-c s5 d2 coln2 coln1)
   deleted: (on s5 d2) (colspace coln2)
   added: (bottomcol s5) (clear d2) (faceup d2) (colspace coln1)
   goals met: 2 of 4
24. (tal-to-home-b da s2 d0 d n1 n0)
   deleted: (bottomtalon da) (talonplayable da) (ontalon s2 da) (home d0)
   added: (bottomtalon s2) (talonplayable s2) (home da)
   goals met: 2 of 4
25. (col-to-home-b d2 da d n2 n1 coln1 coln2)
   deleted: (home da) (faceup d2) (clear d2) (bottomcol d2) (colspace coln1)
   added: (home d2) (colspace coln2)
   goals met: 2 of 4
26. (col-to-home d3 s4 d n3 d2 n2)
   deleted: (on d3 s4) (home d2) (faceup d3) (clear d3)
   added: (home d3) (clear s4) (on d3 d2)
   goals met: 2 of 4
27. (tal-to-home-d s2 sa s n2 n1)
   deleted: (home sa) (toptalon s2) (talonplayable s2) (bottomtalon s2)
   added: (home s2)
   goals met: 2 of 4
28. (col-to-home s3 d4 s n3 s2 n2)
   deleted: (on s3 d4) (home s2) (faceup s3) (clear s3)
   added: (home s3) (clear d4) (on s3 s2)
   goals met: 2 of 4
29. (col-to-home s4 d5 s n4 s3 n3)
   deleted: (on s4 d5) (home s3) (faceup s4) (clear s4)
   added: (home s4) (clear d5) (on s4 s3)
   goals met: 2 of 4
30. (col-to-home d4 s5 d n4 d3 n3)
   deleted: (on d4 s5) (home d3) (faceup d4) (clear d4)
   added: (home d4) (clear s5) (on d4 d3)
   goals met: 2 of 4
31. (col-to-home-b s5 s4 s n5 n4 coln2 coln3)
   deleted: (home s4) (faceup s5) (clear s5) (bottomcol s5) (colspace coln2)
   added: (home s5) (colspace coln3)
   goals met: 3 of 4
32. (col-to-home-b d5 d4 d n5 n4 coln3 coln4)
   deleted: (home d4) (faceup d5) (clear d5) (bottomcol d5) (colspace coln3)
   added: (home d5) (colspace coln4)
   goals met: 4 of 4
